In [1]:
people = {
    "first" : ["Dan", "Bala", "John"],
    "last" : ["cake", "chao", "cina"],
    "email" : ["dancake@gmail.com", "balachao@gmail.com", "johncina@gmail.com"]
}

In [2]:
import pandas as pd
df = pd.DataFrame(people)
df

  first  last               email
0   Dan  cake   dancake@gmail.com
1  Bala  chao  balachao@gmail.com
2  John  cina  johncina@gmail.com

In [3]:
df['first']+' '+df['last']

0     Dan cake
1    Bala chao
2    John cina
dtype: object

In [5]:
# will create a new col name full_name
df['full_name'] = df['first'] + ' ' + df['last']
df

  first  last               email  full_name
0   Dan  cake   dancake@gmail.com   Dan cake
1  Bala  chao  balachao@gmail.com  Bala chao
2  John  cina  johncina@gmail.com  John cina

In [7]:
# lets drop two cols first and last
df.drop(columns=['first', 'last'], inplace = True)

In [8]:
df

                email  full_name
0   dancake@gmail.com   Dan cake
1  balachao@gmail.com  Bala chao
2  johncina@gmail.com  John cina

In [9]:
df['full_name'].str.split(' ')

0     [Dan, cake]
1    [Bala, chao]
2    [John, cina]
Name: full_name, dtype: object

In [10]:
df['full_name'].str.split(' ',expand=True)

      0     1
0   Dan  cake
1  Bala  chao
2  John  cina

In [15]:
df[['first', 'last']] = df['full_name'].str.split(' ',expand=True)

In [16]:
df

                email  full_name first  last
0   dancake@gmail.com   Dan cake   Dan  cake
1  balachao@gmail.com  Bala chao  Bala  chao
2  johncina@gmail.com  John cina  John  cina

In [37]:
new_row_dict = {'first': 'Tony'}

# Convert the dictionary to a DataFrame and concatenate
df = pd.concat([df, pd.DataFrame([new_row_dict])], ignore_index=True)

# df = df.drop(df.index[-1]) # to delete the last row
df

                email  full_name first  last
0   dancake@gmail.com   Dan cake   Dan  cake
1  balachao@gmail.com  Bala chao  Bala  chao
2  johncina@gmail.com  John cina  John  cina
3                 NaN        NaN  Tony   NaN
4                 NaN        NaN  Tony   NaN

In [38]:
#let's create another dataframe
people = {
    "first" : ['Tony', 'Steve'],
    "last" : ['Stark', 'Rogers'],
    "email" : ['Ironman@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark  Ironman@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [40]:
pd.concat([df, df2], ignore_index=True)

                email  full_name  first    last
0   dancake@gmail.com   Dan cake    Dan    cake
1  balachao@gmail.com  Bala chao   Bala    chao
2  johncina@gmail.com  John cina   John    cina
3                 NaN        NaN   Tony     NaN
4                 NaN        NaN   Tony     NaN
5  Ironman@avenge.com        NaN   Tony   Stark
6      Cap@avenge.com        NaN  Steve  Rogers

In [49]:

df

                email  full_name first  last
0   dancake@gmail.com   Dan cake   Dan  cake
1  balachao@gmail.com  Bala chao  Bala  chao
2  johncina@gmail.com  John cina  John  cina
3                 NaN        NaN  Tony   NaN
4                 NaN        NaN  Tony   NaN

In [51]:
df.drop(index=3) # 3 no index will be deleted, for parmanently delte we have to use as usual inplace=True

                email  full_name first  last
0   dancake@gmail.com   Dan cake   Dan  cake
1  balachao@gmail.com  Bala chao  Bala  chao
2  johncina@gmail.com  John cina  John  cina
4                 NaN        NaN  Tony   NaN